## Thamer Extra Credit Assignment

In [ ]:
# package
import pandas

In [ ]:
# defining and using variables
x=1
y=5
z=x+1

list_1 = [1,2,3]
list_2 = ['a','b','c']
list_3 = list_1 + list_2
list_3[2:5]

In [6]:
# In one line write a list and assign it to variable named "list_4" that has 
# for element 0: x+y
# for element 1: x*y
# for element 2: 5*x+2*y-22

#<todo>
list_4 = [x+y , x*y , 5*x+2*y-22]
list_4

[6, 5, -7]

In [4]:
#defining functions:

def jonathans_function(x, y):
    temp_1 = x/2
    temp_2 = y/2
    my_string = f"half of x is {temp_1}; half of y is {temp_2}"
    return my_string

my_favorite_number = 31
age_i_want_to_live_to = 101

jonathans_function(age_i_want_to_live_to, my_favorite_number)

'half of x is 50.5; half of y is 15.5'

In [29]:
#Define a function that adds all the values of list_4 above, using parameters

#todo name>(param_1=#todo,param_2=#todo,param_3=#todo):
def jonathans_function(lis):
    return sum(lis)
jonathans_function(list_4)

4

In [31]:
#define a function that multiplies three numbers together:

#todo
def thamir_function(one,two,three):
    return one*two*three
thamir_function(1,2,3)

6

In [33]:
df = pandas.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]],
    columns=['a','b','c'],
    index=[1,2,3]
)

df

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [35]:
df = pandas.DataFrame({'c1':[1,2,3],'c2':[4,5,6],'c3':[7,8,9]})

In [36]:
type(df)

pandas.core.frame.DataFrame

In [37]:
import numpy

random_grades = numpy.random.uniform(low=0.5,high=1,size=30)
random_grades

array([0.51497089, 0.93167964, 0.53604869, 0.96055859, 0.75332506,
       0.5824646 , 0.79275723, 0.50043234, 0.64117619, 0.89605754,
       0.54717708, 0.67801473, 0.73633966, 0.56100892, 0.93902635,
       0.96269705, 0.57462304, 0.67634083, 0.73777329, 0.54941546,
       0.69991678, 0.70561732, 0.83797951, 0.7421626 , 0.79993066,
       0.56747206, 0.77560846, 0.84782998, 0.52176971, 0.92564864])

In [42]:
for i in range(len(random_grades)):
    print(f"grade {i} is {random_grades[i].round(2)}")

grade 0 is 0.51
grade 1 is 0.93
grade 2 is 0.54
grade 3 is 0.96
grade 4 is 0.75
grade 5 is 0.58
grade 6 is 0.79
grade 7 is 0.5
grade 8 is 0.64
grade 9 is 0.9
grade 10 is 0.55
grade 11 is 0.68
grade 12 is 0.74
grade 13 is 0.56
grade 14 is 0.94
grade 15 is 0.96
grade 16 is 0.57
grade 17 is 0.68
grade 18 is 0.74
grade 19 is 0.55
grade 20 is 0.7
grade 21 is 0.71
grade 22 is 0.84
grade 23 is 0.74
grade 24 is 0.8
grade 25 is 0.57
grade 26 is 0.78
grade 27 is 0.85
grade 28 is 0.52
grade 29 is 0.93

In [49]:
# Create a dataframe for 30 students with grades between 50(D) and 100(A+)

# eg:         Grade
# student_1:   77
# student_2:   55
# student_3:   99
#...
# student_30:   77
import pandas as pd
from random import randint
  
data = []

for student in range(1,31):

    data.append(["student"+str(student),str(randint(50, 100))]) 

    

df = pd.DataFrame(data, columns = ['Name', 'Age']) 
  
df

         Name Age
0    student1  63
1    student2  99
2    student3  53
3    student4  82
4    student5  70
5    student6  61
6    student7  77
7    student8  58
8    student9  68
9   student10  63
10  student11  82
11  student12  59
12  student13  97
13  student14  68
14  student15  56
15  student16  82
16  student17  56
17  student18  96
18  student19  57
19  student20  60
20  student21  62
21  student22  82
22  student23  63
23  student24  81
24  student25  86
25  student26  66
26  student27  63
27  student28  73
28  student29  52
29  student30  61